apps/contributions/tests/fixtures/stripe-invoice-upcoming.json

{
  "id": "evt_1M4Tm9BMAMOLTEak9GmrsX6T",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1668536545,
  "data": {
    "object": {
      "id": "in_fakefakefakefake",
      "object": "invoice",
      "account_country": "US",
      "account_name": "News Revenue Hub",
      "account_tax_ids": null,
      "amount_due": 2000,
      "amount_paid": 0,
      "amount_remaining": 2000,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 0,
      "attempted": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "upcoming",
      "charge": null,
      "collection_method": "charge_automatically",
      "created": 1673800146,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_Mo4Aevg5nGwjBr",
      "customer_address": {
        "city": "Chicago",
        "country": "US",
        "line1": "123 Main Street",
        "line2": "Ap 1",
        "postal_code": "27777",
        "state": "IL"
      },
      "customer_email": "foo@bar.com",
      "customer_name": "foo bar",
      "customer_phone": null,
      "customer_shipping": {
        "address": {
          "city": "Chicago",
          "country": "US",
          "line1": "123 Main Street",
          "line2": "Ap 1",
          "postal_code": "27777",
          "state": "IL"
        },
        "name": "foo bar",
        "phone": ""
      },
      "customer_tax_exempt": "null",
      "customer_tax_ids": [
        {
          "type": "us_ein",
          "value": "12-3456789"
        }
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_tmp_1f4255BMAMOLTEaka6308dd4",
            "object": "line_item",
            "amount": 2000,
            "amount_excluding_tax": 2000,
            "currency": "usd",
            "description": "1 × myproduct (at $20.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {},
            "period": {
              "end": 1676478546,
              "start": 1673800146
            },
            "plan": {
              "id": "plan_JyZTNA4Eukw6jP",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1628053657,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_JyZTDWxzX32Py7",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "plan_JyZTNA4Eukw6jP",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1628053657,
              "currency": "usd",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_JyZTDWxzX32Py7",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1M4S3sBMAMOLTEaksmP0WZSs",
            "subscription_item": "si_Mo4CfetvUX5TmU",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription",
            "unit_amount_excluding_tax": "2000"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/upcoming/lines?customer=cus_Mo4Aevg5nGwjBr&subscription=sub_1M4S3sBMAMOLTEaksmP0WZSs"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": 1673803746,
      "number": null,
      "on_behalf_of": null,
      "paid": false,
      "paid_out_of_band": false,
      "payment_intent": null,
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1673800146,
      "period_start": 1671121746,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering_options": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "draft",
      "status_transitions": {
        "finalized_at": null,
        "marked_uncollectible_at": null,
        "paid_at": null,
        "voided_at": null
      },
      "subscription": "sub_1M4S3sBMAMOLTEaksmP0WZSs",
      "subtotal": 2000,
      "subtotal_excluding_tax": 2000,
      "tax": null,
      "test_clock": "clock_1M4S15BMAMOLTEakBQ3cK39u",
      "total": 2000,
      "total_discount_amounts": [],
      "total_excluding_tax": 2000,
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "invoice.upcoming"
}
